<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="utf-8" />
  <meta name="generator" content="Hugo 0.145.0">

  <meta http-equiv="X-UA-Compatible" content="IE=edge" />
  <meta name="viewport" content="width=device-width, initial-scale=1" />
  <meta name="author" content="" />
  <meta property="og:url" content="http://boxcounter.com/posts/2012-05-19-status_invalid_device_object_parameter/" />
  <link rel="canonical" href="http://boxcounter.com/posts/2012-05-19-status_invalid_device_object_parameter/" /><link rel="alternate" type="application/atom+xml" href="http://boxcounter.com/index.xml" title="Boxcounter&#39;s blog">

  <script type="application/ld+json">
  {
      "@context" : "http://schema.org",
      "@type" : "BlogPosting",
      "mainEntityOfPage": {
           "@type": "WebPage",
           "@id": "http:\/\/boxcounter.com\/"
      },
      "articleSection" : "posts",
      "name" : "有关STATUS_INVALID_DEVICE_OBJECT_PARAMETER",
      "headline" : "有关STATUS_INVALID_DEVICE_OBJECT_PARAMETER",
      "description" : "这两天遇到一个问题，记录在这里。 我有两个FS过滤驱动，这里称它们为 A 和 B，A 在 B 之上，其中 B 是个重定向驱动。下面是问题描述： A 调用 FltCreateFile 打开 C: 中的某个文件，B收到这个请求后，指定这个请求重定向到 D:，结果 A收到了错误码 STATUS_INVALID_DEVICE_OBJECT_PARAMETER。 挂上 WRK 调试，发现整个调用栈是这样：\n",
      "inLanguage" : "en-US",
      "author" : "",
      "creator" : "",
      "publisher": "",
      "accountablePerson" : "",
      "copyrightHolder" : "",
      "copyrightYear" : "2012",
      "datePublished": "2012-05-19 00:00:00 \u002b0000 UTC",

</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f"> 8
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f"> 9
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">10
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">11
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">12
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">13
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">14
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">15
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">16
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f">17
</span></code></pre></td>
<td style="vertical-align:top;padding:0;margin:0;border:0;;width:100%">
<pre tabindex="0" style="background-color:#f0f3f3;-moz-tab-size:4;-o-tab-size:4;tab-size:4;display:grid;"><code class="language-c" data-lang="c"><span style="display:flex;"><span>NTSTATUS
</span></span><span style="display:flex;"><span><span style="color:#c0f">FltCreateFile</span>(
</span></span><span style="display:flex;"><span>__in PFLT_FILTER Filter,
</span></span><span style="display:flex; background-color:#d8dada"><span>__in_opt PFLT_INSTANCE Instance,
</span></span><span style="display:flex;"><span>__out PHANDLE FileHandle,
</span></span><span style="display:flex;"><span>__in ACCESS_MASK DesiredAccess,
</span></span><span style="display:flex;"><span>__in POBJECT_ATTRIBUTES ObjectAttributes,
</span></span><span style="display:flex;"><span>__out PIO_STATUS_BLOCK IoStatusBlock,
</span></span><span style="display:flex;"><span>__in_opt PLARGE_INTEGER AllocationSize,
</span></span><span style="display:flex;"><span>__in ULONG FileAttributes,
</span></span><span style="display:flex;"><span>__in ULONG ShareAccess,
</span></span><span style="display:flex;"><span>__in ULONG CreateDisposition,
</span></span><span style="display:flex;"><span>__in ULONG CreateOptions,
</span></span><span style="display:flex;"><span>__in_opt PVOID EaBuffer,
</span></span><span style="display:flex;"><span>__in ULONG EaLength,
</span></span><span style="display:flex;"><span>__in ULONG Flags
</span></span><span style="display:flex;"><span>);</span></span></code></pre></td></tr></table>
</div>
</div>
<p>注意参数 Instance，类型为 PFLT_INSTANCE，看下这个结构：</p>
<pre tabindex="0"><code>kd&gt; dt _FLT_INSTANCE
fltMgr!_FLT_INSTANCE
+0x000 Base : _FLT_OBJECT
+0x014 OperationRundownRef : Ptr32 _EX_RUNDOWN_REF_CACHE_AWARE
+0x018 Volume : Ptr32 _FLT_VOLUME        &lt;&lt;&lt;---
+0x01c Filter : Ptr32 _FLT_FILTER
+0x020 Flags : _FLT_INSTANCE_FLAGS
+0x024 Altitude : _UNICODE_STRING
+0x02c Name : _UNICODE_STRING
+0x034 FilterLink : _LIST_ENTRY
+0x03c ContextLock : _ERESOURCE
+0x074 Context : Ptr32 _CONTEXT_NODE
+0x078 TrackCompletionNodes : Ptr32 _TRACK_COMPLETION_NODES
+0x07c CallbackNodes : [50] Ptr32 _CALLBACK_NODE
</code></pre><p>注意其中 0x18 偏移处的 Volume，类型为 _FLT_VOLUME，看下这个结构：</p>
<pre tabindex="0"><code>kd&gt; dt fltMgr!_FLT_VOLUME
+0x000 Base : _FLT_OBJECT
+0x014 Flags : _FLT_VOLUME_FLAGS
+0x018 FileSystemType : _FLT_FILESYSTEM_TYPE
+0x01c DeviceObject : Ptr32 _DEVICE_OBJECT        &lt;&lt;&lt;---
+0x020 DiskDeviceObject : Ptr32 _DEVICE_OBJECT
+0x024 VolumeInNextFrame : Ptr32 _FLT_VOLUME
+0x028 Frame : Ptr32 _FLTP_FRAME
+0x02c DeviceName : _UNICODE_STRING
+0x034 GuidName : _UNICODE_STRING
+0x03c CDODeviceName : _UNICODE_STRING
+0x044 CDODriverName : _UNICODE_STRING
+0x04c InstanceList : _FLT_RESOURCE_LIST_HEAD
+0x090 Callbacks : _CALLBACK_CTRL
+0x220 ContextLock : _ERESOURCE
+0x258 VolumeContexts : _CONTEXT_LIST_CTRL
+0x25c StreamListCtrls : _FLT_RESOURCE_LIST_HEAD
+0x2a0 NameCacheCtrl : _NAME_CACHE_VOLUME_CTRL
+0x2d0 MountNotifyLock : _ERESOURCE
+0x308 HiddenOperationState : [4] _FLTP_TRACK_WHEN_TO_HIDE
</code></pre><p>注意其中 0x1c 偏移处的 DeviceObject，这个就是传递给 IoCreateFileSpecifyDeviceObjectHint 的 DOHint，来看下这个函数的原型：
<div class="highlight"><div style="background-color:#f0f3f3;-moz-tab-size:4;-o-tab-size:4;tab-size:4;display:grid;">
<table style="border-spacing:0;padding:0;margin:0;border:0;"><tr><td style="vertical-align:top;padding:0;margin:0;border:0;">
<pre tabindex="0" style="background-color:#f0f3f3;-moz-tab-size:4;-o-tab-size:4;tab-size:4;display:grid;"><code><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f"> 1
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f"> 2
</span><span style="white-space:pre;-webkit-user-select:none;user-select:none;margin-right:0.4em;padding:0 0.4em 0 0.4em;color:#7f7f7f"> 3
